<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.AnyConnect</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Networking</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>AnyConnect</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>AnyConnect</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Cisco AnyConnect VPN software. Connect to VPNs and access internal resources.</string>
			<key>developer</key>
			<string>Cisco Systems, Inc.</string>
			<key>preinstall_script</key>
			<string>#!/bin/sh
			vpn_conf_dir="$3/opt/cisco/anyconnect/profile"
				vpn_conf="${vpn_conf_dir}/vpnserver.example.com.xml"
				mkdir -p "${vpn_conf_dir}"
			cat <<EOF >"${vpn_conf}"
			<?xml version="1.0" encoding="UTF-8"?>
			<AnyConnectProfile xmlns="http://schemas.xmlsoap.org/encoding/">;
			  <ServerList>
			    <HostEntry>
			      <HostName>vpnserver.example.com</HostName>
			      <HostAddress>vpnserver.example.com</HostAddress>
			    </HostEntry>
			  </ServerList>
			</AnyConnectProfile>
			EOF
			exit 0</string>
			<key>installer_choices_xml</key>
			<array>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_vpn</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>0</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_websecurity</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_dart</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>choice_posture</string>
				</dict>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jessepeterson.munki.AnyConnect</string>
</dict>
</plist>
